app/views/articles/_form.html.erb

SELECT `categories`.* FROM `categories`
---
    <%= f.label :category %><br>
	<%= f.select :category_id ,Category.all.map {|c| [c.cn_name, c.id]},{}, class:"form-control" %>