app/views/articles/check_category.html.erb

	<%=label_tag '若想重新分类，请选择:' %>
	<%= select_tag 'category', options_from_collection_for_select(Category.all,'name','name'), :class=>"form-control" %><br/>
---
SELECT `categories`.* FROM `categories`