app/views/articles/show.html.erb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1
---
  <strong>Category:</strong>
  <%= Category.find(@article.category_id).cn_name%>