app/controllers/articles_controller.rb

  def find
    #@articles = Article.order("id DESC")
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def create

     @article = Article.new(article_params)

      #获取文章所属类别
      myParams = {}
      myParams[:label] = params[:article][:content]
      categoryURI = 'http://139.196.13.138:8080/robin8/label.jsp'
      uri = URI.parse(categoryURI)
      res = Net::HTTP.post_form(uri,myParams)
      category = ActiveSupport::JSON.decode(res.body)
      unless category['category'].nil?
         category_info = Category.where('`name`= ? ',category['category'])
         if (category_info[0])
           params[:article][:category_id] = category_info[0].id
         end
      end

      params[:article][:category_id] = 14 unless params[:article].has_key?(:category_id)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `content`, `keyword`, `source`, `created_at`, `updated_at`) VALUES ('测试', '测试', '测试啊', 1, '2015-10-30 21:54:23.918491', '2015-10-30 21:54:23.918491')

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE `articles` SET `keyword` = 'test2', `updated_at` = '2015-10-30 22:29:11.100653' WHERE `articles`.`id` = 12

  def destroy
    @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 10